// Вывести на экран частное двух чисел
double numberA = 10; // можем выбирать и дробные числа (double)
double numberB = 3;
double result = numberA / numberB;
Console.WriteLine(numberA / numberB);

