// Вывести на экран частное двух чисел
double numberA = 10;
double numberB = 3;
double result = numberA / numberB;
Console.WriteLine(numberA / numberB);

